import { LocationsCard } from "./LocationsCard";

export const LocationsGrid = () => {  
  const locationsData = [
    {
      id: 1,
      rate: 5,
      title: "Києво-печерська лавра",
      region: "kyivska",
      author: "Dima Vakhmianin",
      poster: "",
      place: 'monument',
      description:
        "Ки́єво-Пече́рська ла́вра — київський православний монастирський комплекс. Один із найбільших християнських центрів України, визначна пам'ятка історії та архітектури. Києво-Печерська лавра належить державі, а релігійні організації користуються нею на правах оренди[2].Заснована 1051 року як печерний монастир за межами Києва. Лавра отримала свою назву від печер, де оселилися її перші мешканці[3].",
      reviews: [],
    },
    {
      id: 2 ,

      rate: 5,
      title: "Києво-печерська лавра",
      region: "kyivska",
      author: "Dima Vakhmianin",
      poster: "",
      place: 'monument',

      description:
        "Ки́єво-Пече́рська ла́вра — київський православний монастирський комплекс. Один із найбільших християнських центрів України, визначна пам'ятка історії та архітектури. Києво-Печерська лавра належить державі, а релігійні організації користуються нею на правах оренди[2].Заснована 1051 року як печерний монастир за межами Києва. Лавра отримала свою назву від печер, де оселилися її перші мешканці[3].",
      reviews: [],
    },
    {
      id: 3,

      rate: 5,
      title: "Києво-печерська лавра",
      region: "kyivska",
      author: "Dima Vakhmianin",
      poster: "",
      place: 'monument',

      description:
        "Ки́єво-Пече́рська ла́вра — київський православний монастирський комплекс. Один із найбільших християнських центрів України, визначна пам'ятка історії та архітектури. Києво-Печерська лавра належить державі, а релігійні організації користуються нею на правах оренди[2].Заснована 1051 року як печерний монастир за межами Києва. Лавра отримала свою назву від печер, де оселилися її перші мешканці[3].",
      reviews: [],
    },
  ];
  return(
    <ul>
      {locationsData.map((location) => (
        <li key={location.id}><LocationsCard place={location.place} img={location.poster} rating={location.rate} title={location.title} /></li>
        
      ))}
    </ul>
  )
};
